snlkuharlocal/src/Documents/ЗаявкаНаСкидки/ЗаявкаНаСкидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаСкидки</name>
  <basedOn>Document.УстановкаСкидок</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСкидок</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействителенПо</name>
    <comment>Дата окончания действия скидок</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.УстановкаСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокНаСкидки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбмена</name>
    <comment>Статус обмена</comment>
    <type>
      <types>EnumRef.СтатусыОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗаявки</name>
    <type>
      <types>EnumRef.ВидыЗаявокНаСкидки</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Скидки</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТовара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Брэнд</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/СкидкиНоменклатуры/СкидкиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СкидкиНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТипСкидок</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.УстановкаСкидок</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СтатусыЗаявокНаСкидки/СтатусыЗаявокНаСкидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявокНаСкидки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаявкаНаСкидки/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура СоздатьНаОсновании(Команда)
	
	СсылкаНаОбъект = Элементы.Список.ТекущиеДанные.Ссылка;
	
	Если ЗначениеНеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Статус = ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, "Статус");
	
	Если Статус <> Перечисления.СтатусыЗаявокНаСкидки.Утверждена Тогда
		Сообщить("Заявка не в статусе <Утверждена>");
		Возврат;
	КонецЕсли;
	
	СписокДокументов = ЗаполнениеДокументов.СуществуютТипыДокументовВводимыеНаОсновании(СсылкаНаОбъект);
	
	ВыбЭлемент = СписокДокументов.ВыбратьЭлемент("Выберите основание");
	
	Если ВыбЭлемент <> Неопределено Тогда
		
		Длина = СтрДлина(ВыбЭлемент.Значение);
		Позиция = Найти(ВыбЭлемент.Значение, ".");
		Имя = Прав(ВыбЭлемент.Значение, Длина - Позиция);
		
		ПолноеИмяФормы = "Документ." + Имя + ".Форма.ФормаДокумента";
		
		ДокОбъект = Документы[Имя].СоздатьДокумент();
		//крохин начало 27.12.2022
		//ДокОбъект.Дата = ТекущаяДата();
		ДокОбъект.Дата = НачалоДня(ТекущаяДата());
		//крохин конец 27.12.2022
		Если ЕстьРеквизитДокумента("Дата2", ДокОбъект.Метаданные()) Тогда
			ДокОбъект.Дата2 = КонецГода((ТекущаяДата()+31536000));	
		КонецЕсли;
		ДокОбъект.Заполнить(СсылкаНаОбъект);
		
		// Кухарь А.Ю.  31.03.2023 начало
		// ДокОбъект.дата=НачалоДня(ДокОбъект.дата);
		ДокОбъект.дата=НачалоДня(ДокОбъект.дата);	
		ДокОбъект.Дата2=СсылкаНаОбъект.ДействителенПо;
		// Кухарь А.Ю.  31.03.2023 конец

		
		ДокОбъект.Записать();
		
		НаборЗаписей = РегистрыСведений.СкидкиНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка);
		НаборЗаписей.Прочитать();
		
		ТабличнаяЧасть = СсылкаНаОбъект["Скидки"].Выгрузить();
		
		Для Каждого Стр ИЗ ТабличнаяЧасть Цикл
			
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Стр);
			
			НоваяЗапись.Документ = ДокОбъект.Ссылка;
			НоваяЗапись.Период = ДокОбъект.Дата;
			НоваяЗапись.ТипСкидок = ДокОбъект.ТипСкидок;
			
		КонецЦикла;
		
		НаборЗаписей.Записать(Истина);
		
		ФормаДокумента = ДокОбъект.ПолучитьФорму();
		ФормаДокумента.Открыть();
		
	КонецЕсли;
	
КонецПроцедуры
